Repository: ekondareva/auctionSample-Python-Django
Catalog: YAAS/locale/*/LC_MESSAGES/django.po
Languages: fi

source: Description
fi: Description fi

source: Minimum price
fi: Minimum price fi

source: Save
fi: Save fi

source: Title
fi: Title fi

source: Thank you
fi: Thank you fi

source: You may proceed to
fi: You may proceed to fi

source: homepage
fi: homepage fi

source: Home
fi: Home fi

source: Sign In
fi: Sign In fi

source: Last bid
fi: Last bid fi

source: Due date
fi: Due date fi

source: Your bid
fi: Your bid fi

source: Register new account
fi: Register new account fi

source: Login
fi: Login fi

source: Password
fi: Password fi

source: Confirm Password
fi: Confirm Password fi

source: First Name
fi: First Name fi

source: Last Name
fi: Last Name fi

source: Email
fi: Email fi

source: Edit account information
fi: Edit account information fi

source: First name
fi: First name fi

source: Last name
fi: Last name fi

source: New Password
fi: New Password fi

source: Auctions
fi: Auctions fi

source: Search
fi: Search fi

source: Edit
fi: Edit fi

source: Bid
fi: Bid fi

source: Ban
fi: Ban fi

source: Please sign in
fi: Please sign in fi

source: Sign in
fi: Sign in fi

source: Don't have a username?
fi: Don't have a username? fi

source: Create
fi: Create fi
